app/controllers/experiences_controller.rb

INSERT INTO "experiences" ("company", "position", "description", "start", "end", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def new
        current_user.profile.experiences.create