app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "profiles" SET "name" = $1, "job_title" = $2, "total_experience" = $3, "career_highlights" = $4, "overview" = $5, "primary_skills" = $6, "secondary_skills" = $7, "updated_at" = $8 WHERE "profiles"."id" = $9
---
    def update
        updated_profile_params = update_array_attributes_in_params(profile_params)
        @profile = Profile.find(params[:id])
        if @profile.update(updated_profile_params)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def correct_user
        @profile = Profile.find(params[:id])
        @user = User.find(@profile.user_id)