app/controllers/projects_controller.rb

    def new
        current_user.profile.projects.create
---
INSERT INTO "projects" ("title", "url", "techstack", "description", "profile_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", nil], ["url", nil], ["techstack", nil], ["description", nil], ["profile_id", 4], ["created_at", "2022-02-11 11:04:12.580188"], ["updated_at", "2022-02-11 11:04:12.580188"]]