app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Johnsas"], ["email", "rjpasastil53@example.com"], ["created_at", "2022-02-18 11:38:19.266269"], ["updated_at", "2022-02-18 11:38:19.266269"], ["password_digest", "[FILTERED]"]]
---
	def new
		@new_user = User.new(user_params)
		if @new_user.save && params[:password] == params[:password_confirmation]